Repository: huixiangyang/arc-kit
Catalog: Sources/Features/Finder/Domain/Resources/Localization/Finder.xcstrings
Source language: en
Languages: zh_hans

# action.finder.action.disabled.reason
source: Finder action disabled reason
zh_hans: Finder 动作禁用原因

# action.finder.action.id
source: Finder action ID
zh_hans: Finder 动作 ID

# action.finder.action.title
source: Finder action title
zh_hans: Finder 动作标题

# action.image.conversion.format
source: Image conversion format
zh_hans: 图片转换格式

# action.invalidFolderName
source: Target folder name cannot contain path separators
zh_hans: 目标文件夹名称不能包含路径分隔符

# action.invalidName
source: %1$@ cannot be empty or have leading or trailing whitespace
zh_hans: %1$@不能为空或包含首尾空白

# action.newFile.template.id
source: New file template ID
zh_hans: 新建模板 ID

# action.path.action.target
source: Path action target
zh_hans: 路径动作目标

# action.path.action.target.absolute
source: Path action target must be absolute
zh_hans: 路径动作目标必须是绝对路径

# action.target.folder.name
source: Target folder name
zh_hans: 目标文件夹名称

# app.favorite.app.bundleidentifier
source: Favorite app bundleIdentifier
zh_hans: 常用 App bundleIdentifier

# app.favorite.app.name
source: Favorite app name
zh_hans: 常用 App 名称

# app.favorite.app.path
source: Favorite app path
zh_hans: 常用 App 路径

# app.favorite.app.path.absolute
source: Favorite app path must be absolute
zh_hans: 常用 App 路径必须是绝对路径

# app.favorite.apps.require.least.bundleidentifier
source: Favorite apps require at least a bundleIdentifier or appPath
zh_hans: 常用 App 必须至少包含 bundleIdentifier 或 appPath

# app.finder
source: Finder
zh_hans: 访达

# command.compress.files
source: Compress Files
zh_hans: 压缩文件

# command.convert.image
source: Convert Image
zh_hans: 转换图片

# command.copy.checksum
source: Copy Checksum
zh_hans: 复制哈希

# command.copy.file.info
source: Copy File Info
zh_hans: 复制文件信息

# command.copy.path
source: Copy Path
zh_hans: 复制路径

# command.extract.icon
source: Extract Icon
zh_hans: 提取图标

# command.flatten.folder
source: Flatten Folder
zh_hans: 解除文件夹

# command.restore.folder.icon
source: Restore Folder Icon
zh_hans: 还原文件夹图标

# directory.favorite.folder.path.absolute
source: Favorite folder path must be absolute
zh_hans: 常用目录路径必须是绝对路径

# directory.folder
source: This Folder Only
zh_hans: 仅此目录

# directory.include.files.subfolders
source: Include Files and Subfolders
zh_hans: 包含下级文件与文件夹

# directory.include.subfolders
source: Include Subfolders
zh_hans: 包含下级文件夹

# directory.invalidName
source: Favorite folder name cannot be empty or have leading or trailing whitespace
zh_hans: 常用目录名称不能为空或包含首尾空白

# directory.invalidPath
source: Favorite folder path cannot be empty or have leading or trailing whitespace
zh_hans: 常用目录路径不能为空或包含首尾空白

# execution.state.invalid.finder.command.runtime.lifecycle
source: Invalid Finder command runtime lifecycle
zh_hans: Finder 命令执行运行态生命周期无效

# execution.state.invalidIdentity
source: Invalid Finder command runtime Agent identity
zh_hans: Finder 命令执行运行态 Agent 身份无效

# execution.state.invalidParameters
source: Invalid Finder command runtime parameters
zh_hans: Finder 命令执行运行态参数无效

# execution.state.schemaMismatch
source: Finder command runtime schema mismatch: expected=%1$@, actual=%2$@
zh_hans: Finder 命令执行运行态 schema 不匹配：expected=%1$@ actual=%2$@

# extension.h.ago
source: %1$@h ago
zh_hans: %1$@ 小时前

# extension.m.ago
source: %1$@m ago
zh_hans: %1$@ 分钟前

# extension.notReceived
source: Not received
zh_hans: 未收到

# extension.s.ago
source: %1$@s ago
zh_hans: %1$@ 秒前

# extension.state.invalid.finder.extension.action.runtime
source: Invalid Finder extension action runtime
zh_hans: Finder 扩展点击运行态无效

# extension.state.invalid.finder.extension.menu.runtime
source: Invalid Finder extension menu runtime
zh_hans: Finder 扩展菜单运行态无效

# extension.state.invalidIdentity
source: Invalid Finder extension runtime identity
zh_hans: Finder 扩展运行态身份无效

# extension.state.invalidProcesses
source: Invalid Finder extension runtime process set
zh_hans: Finder 扩展运行态进程集合无效

# extension.state.schemaMismatch
source: Finder extension runtime schema mismatch: expected=%1$@, actual=%2$@
zh_hans: Finder 扩展运行态 schema 不匹配：expected=%1$@ actual=%2$@

# extension.state.unsafeDirectories
source: Finder extension runtime contains unsafe watched directories
zh_hans: Finder 扩展运行态包含不安全监听目录

# ipc.connectionFailed
source: Cannot connect to Finder Agent: %1$@
zh_hans: 无法连接 Finder Agent：%1$@

# ipc.finder.agent.returned.damaged.response
source: Finder Agent returned a damaged response
zh_hans: Finder Agent 返回了损坏的响应

# ipc.finder.component.identity.mismatch
source: Finder component identity mismatch: %1$@
zh_hans: Finder 组件身份不匹配：%1$@

# ipc.finder.secure.ipc.contains.payload.disallowed
source: Finder secure IPC contains a payload disallowed for this operation
zh_hans: Finder 安全通信夹带了当前操作不允许的载荷

# ipc.identityFailed
source: Cannot verify Finder component identity: %1$@
zh_hans: 无法验证 Finder 组件身份：%1$@

# ipc.payloadLimit
source: Finder secure IPC payload exceeds 8 MiB
zh_hans: Finder 安全通信载荷超过 8 MiB 上限

# ipc.required.finder.secure.ipc.payload.missing
source: Required Finder secure IPC payload missing
zh_hans: Finder 安全通信缺少必要载荷

# ipc.unrecognized.finder.secure.ipc.message
source: Unrecognized Finder secure IPC message
zh_hans: Finder 安全通信收到无法识别的消息

# menu.about.hidden.files
source: About Hidden Files
zh_hans: 关于系统隐藏文件

# menu.batch.rename
source: Batch Rename…
zh_hans: 批量重命名…

# menu.copy
source: Copy %1$@
zh_hans: 复制 %1$@

# menu.copy.filename
source: Copy filename
zh_hans: 复制文件名

# menu.copy.other.location
source: Copy to Other Location…
zh_hans: 复制到其他位置…

# menu.copyTo
source: Copy To
zh_hans: 复制到

# menu.delete.permanently
source: Delete Permanently
zh_hans: 彻底删除

# menu.hide.other.items.same.folder
source: Hide other items in the same folder
zh_hans: 隐藏同目录其他项目

# menu.hide.selected.files
source: Hide Selected Files
zh_hans: 隐藏已选文件

# menu.lock
source: Lock
zh_hans: 上锁

# menu.move
source: Move To
zh_hans: 移动到

# menu.move.new.folder
source: Move into New Folder…
zh_hans: 移入新文件夹…

# menu.move.other.location
source: Move to Other Location…
zh_hans: 移动到其他位置…

# menu.new
source: New %1$@
zh_hans: 新建 %1$@

# menu.new.tab
source: New Tab
zh_hans: 新建标签

# menu.new.window
source: New Window
zh_hans: 新建窗口

# menu.open
source: Open %1$@
zh_hans: 打开 %1$@

# menu.openIn
source: Open in %1$@
zh_hans: 在 %1$@ 中打开

# menu.openWith
source: Open with %1$@
zh_hans: 用 %1$@ 打开

# menu.run.script
source: Run Script…
zh_hans: 执行脚本…

# menu.set.folder.icon
source: Set Folder Icon…
zh_hans: 设置文件夹图标…

# menu.tree.favorite.folder.child.path.absolute
source: Favorite folder child path must be absolute
zh_hans: 常用目录子项必须使用绝对路径

# menu.tree.invalid.favorite.folder.child.title
source: Invalid favorite folder child title
zh_hans: 常用目录子项标题无效

# menu.unhide.files
source: Unhide Files
zh_hans: 取消隐藏文件

# menu.unlock
source: Unlock
zh_hans: 解锁

# menu.validation.additional.watched.directories.unique
source: Additional watched directories must be unique
zh_hans: 附加生效目录不能重复

# menu.validation.emptyDirectory
source: Additional watched directories cannot be empty or have leading or trailing whitespace
zh_hans: 附加生效目录不能为空或包含首尾空白

# menu.validation.favorite.app.bundleIDs.paths
source: Favorite app bundle identifiers and paths must be unique
zh_hans: 常用 App bundleIdentifier 或路径不能重复

# menu.validation.favorite.app.ids.unique
source: Favorite app IDs must be unique
zh_hans: 常用 App ID 不能重复

# menu.validation.favorite.folder.ids.unique
source: Favorite folder IDs must be unique
zh_hans: 常用目录 ID 不能重复

# menu.validation.favorite.folder.paths.unique
source: Favorite folder paths must be unique
zh_hans: 常用目录路径不能重复

# menu.validation.incompleteModules
source: Finder menu modules must include every current module exactly once
zh_hans: Finder 菜单模块必须完整覆盖全部当前模块且不能重复

# menu.validation.newFile.template.ids.unique
source: New file template IDs must be unique
zh_hans: 新建模板 ID 不能重复

# menu.validation.protectedDirectory
source: Additional watched directories include protected system or container folders
zh_hans: 附加生效目录包含受保护系统或容器目录

# menu.validation.relativeDirectory
source: Additional watched directories must use absolute paths
zh_hans: 附加生效目录必须是绝对路径

# module.advanced.tools
source: Advanced Tools
zh_hans: 高级工具

# module.folder.icon
source: Folder Icon
zh_hans: 文件夹图标

# module.open
source: Open With
zh_hans: 使用应用打开

# module.organize.files
source: Organize Files
zh_hans: 文件整理

# module.pick.image.color
source: Pick Image Color
zh_hans: 拾取图片颜色

# module.terminal
source: Terminal
zh_hans: 终端

# page.favorite.folders
source: Favorite Folders
zh_hans: 常用目录

# page.newFile
source: New File
zh_hans: 新建文件

# rename.add.prefix
source: Add Prefix
zh_hans: 添加前缀

# rename.add.suffix
source: Add Suffix
zh_hans: 添加后缀

# rename.batch.rename.original.names.failed
source: Batch rename failed and original names could not be fully restored. Original error: %1$@; recovery error: %2$@
zh_hans: 批量重命名失败，且无法完整恢复原名称。原始错误：%1$@；恢复错误：%2$@

# rename.batch.rename.original.names.restored.failed
source: Batch rename failed. Original names restored: %1$@
zh_hans: 批量重命名失败，已恢复原名称：%1$@

# rename.destination.name.already.exists
source: Destination name already exists: %1$@
zh_hans: 目标名称已存在：%1$@

# rename.empty.name
source: (empty name)
zh_hans: （空名称）

# rename.emptyAddition
source: Text to add cannot be empty
zh_hans: 要添加的文字不能为空

# rename.emptyBaseName
source: Base name cannot be empty
zh_hans: 基础名称不能为空

# rename.emptySearch
source: Search text cannot be empty
zh_hans: 查找内容不能为空

# rename.find.replace
source: Find and Replace
zh_hans: 查找并替换

# rename.finder.selection.rename.missing
source: No Finder selection to rename.
zh_hans: 没有可重命名的 Finder 选中项。

# rename.generated.invalid.filename
source: Generated an invalid filename: %1$@
zh_hans: 生成了无效文件名：%1$@

# rename.invalid.rename.rule
source: Invalid rename rule: %1$@
zh_hans: 重命名规则无效：%1$@

# rename.invalidNumberWidth
source: Number width must be between 1 and 6 digits
zh_hans: 编号位数必须在 1 到 6 之间

# rename.multiple.items.receive.same.name
source: Multiple items would receive the same name: %1$@
zh_hans: 多个项目会被改成同一个名称：%1$@

# rename.negativeStart
source: Starting number cannot be negative
zh_hans: 起始编号不能小于 0

# rename.noChanges
source: The current rule does not change any names.
zh_hans: 当前规则不会改变任何名称。

# rename.number.sequentially
source: Number Sequentially
zh_hans: 按序编号

# rename.original.file.longer.exists.missing
source: Original file no longer exists: %1$@
zh_hans: 原文件已不存在：%1$@

# rename.undoItemMissing
source: Cannot undo: renamed item no longer exists: %1$@
zh_hans: 无法撤销：重命名后的项目已不存在：%1$@

# rename.undoItemReplaced
source: Cannot undo: renamed item was replaced: %1$@
zh_hans: 无法撤销：重命名后的项目已被替换：%1$@

# rename.undoNameOccupied
source: Cannot undo: original name is occupied by another item: %1$@
zh_hans: 无法撤销：原名称已被其他项目占用：%1$@

# request.payloadMismatch
source: FinderCommandRequest.kind does not match payload.kind
zh_hans: FinderCommandRequest.kind 与 payload.kind 不一致

# script.validation.available.script.interpreter.missing
source: No available script interpreter: %1$@
zh_hans: 未找到可用的脚本解释器：%1$@

# script.validation.regular.script.files.executed
source: Only regular script files can be executed: %1$@
zh_hans: 只能执行普通脚本文件：%1$@

# script.validation.script.file.missing
source: Script file not found: %1$@
zh_hans: 脚本文件不存在：%1$@

# script.validation.script.path.normalized.absolute
source: Script path must be a normalized absolute path: %1$@
zh_hans: 脚本路径必须是规范化的绝对路径：%1$@

# script.validation.script.unreadable
source: Script is unreadable: %1$@
zh_hans: 脚本文件不可读：%1$@

# script.validation.selected.folder.instead.script
source: Selected a folder instead of a script: %1$@
zh_hans: 选择的是文件夹，不是脚本文件：%1$@

# script.validation.sizeLimit
source: Script exceeds the 8 MB limit: %1$@
zh_hans: 脚本文件超过 8 MB 限制：%1$@

# script.validation.symlinkRejected
source: Symlink scripts are not allowed, to prevent execution targets from being replaced: %1$@
zh_hans: 为避免执行目标被替换，不允许执行符号链接脚本：%1$@

# script.validation.unsupportedType
source: Unsupported script type: .%1$@. Supported: .sh, .py and .js.
zh_hans: 不支持的脚本类型：.%1$@。当前支持 .sh、.py、.js。

# snapshot.appNotInstalled
source: App not installed
zh_hans: 应用未安装

# snapshot.childLimit
source: Favorite folder snapshots cannot exceed 20 children
zh_hans: 常用目录预计算子项不能超过 20 项

# snapshot.favorite.folder.child.paths.unique
source: Favorite folder child paths must be unique
zh_hans: 常用目录预计算子项路径不能重复

# snapshot.favorite.folder.child.titles.match.non
source: Favorite folder child titles must match non-hidden filenames
zh_hans: 常用目录预计算子项标题必须匹配非隐藏文件名

# snapshot.favorite.folder.snapshot.children.direct
source: Favorite folder snapshot children must be direct children of the configured folder
zh_hans: 常用目录预计算子项必须是配置目录的直接子项

# snapshot.finder.extension.snapshot.contains.data
source: Finder extension snapshot contains data that the current schema would silently change
zh_hans: Finder 扩展快照配置包含会被当前 schema 隐式改写的数据

# snapshot.folder.missing.disconnected
source: Folder missing or disconnected
zh_hans: 目录不存在或未连接

# snapshot.invalid.finder.extension.snapshot.configuration
source: Invalid Finder extension snapshot configuration: %1$@
zh_hans: Finder 扩展快照配置无效：%1$@

# snapshot.schemaMismatch
source: FinderExtensionSnapshot schema mismatch; old snapshot ignored
zh_hans: FinderExtensionSnapshot schema 不匹配，旧快照将被忽略

# template.custom.template.file.paths.absolute
source: Custom template file paths must be absolute
zh_hans: 用户模板文件路径必须是绝对路径

# template.hidden.real.template.file.arcKit.missing
source: Hidden: no real template file. Arc Kit does not create invalid placeholder files.
zh_hans: 已隐藏：没有真实模板文件，Arc Kit 不会生成打不开的假文件

# template.hidden.template.file.missing
source: Hidden: template file missing
zh_hans: 已隐藏：缺少模板文件

# template.hidden.template.source.missing.unreadable
source: Hidden: template source missing or unreadable
zh_hans: 已隐藏：模板源文件缺失或不可读

# template.invalidExtension
source: New file template extensions cannot contain path separators
zh_hans: 新建模板扩展名不能包含路径分隔符

# template.invalidResourceName
source: Built-in template resource names cannot contain path separators
zh_hans: 内置模板资源名不能包含路径分隔符

# template.new
source: New %1$@
zh_hans: 新建%1$@

# template.newDocumentName
source: New %1$@.%2$@
zh_hans: 新建%1$@.%2$@

# template.newFile.template.app.bundle.id
source: New file template app Bundle ID
zh_hans: 新建模板应用 Bundle ID

# template.newFile.template.app.bundle.ids
source: New file template app Bundle IDs must be unique
zh_hans: 新建模板应用 Bundle ID 不能重复

# template.newFile.template.extension
source: New file template extension
zh_hans: 新建模板扩展名

# template.newFile.template.missing.received.available
source: New file template not found. Received: %1$@ Available templates: %2$@
zh_hans: 未找到对应的新建文件模板。 收到：%1$@ 可用模板：%2$@

# template.newFile.template.name
source: New file template name
zh_hans: 新建模板名称

# template.newFile.template.original.filename
source: New file template original filename
zh_hans: 新建模板原始文件名

# template.sourceRequired
source: New file template source cannot be empty or have leading or trailing whitespace
zh_hans: 新建模板源不能为空或包含首尾空白

# template.template.files.explicit.extension
source: Template files must have an explicit extension. Arc Kit does not guess file types.
zh_hans: 模板文件必须包含明确的扩展名，Arc Kit 不会猜测文件类型

# template.template.name.nonempty.contain.missing
source: Template name must be nonempty, contain no line breaks and be at most 40 characters
zh_hans: 模板名称不能为空、包含换行或超过 40 个字符

# template.wps.document
source: WPS Document
zh_hans: WPS 文档

# template.wps.presentation
source: WPS Presentation
zh_hans: WPS 演示

# template.wps.spreadsheet
source: WPS Spreadsheet
zh_hans: WPS 表格

# transfer.copy
source: Copy
zh_hans: 复制

# transfer.duplicate.selected.item
source: Duplicate selected item: %1$@
zh_hans: 选中项重复：%1$@

# transfer.finder.selection.transfer.missing
source: No Finder selection to transfer.
zh_hans: 没有可传输的 Finder 选中项。

# transfer.invalidDestination
source: Destination is not an available folder: %1$@
zh_hans: 目标位置不是可用文件夹：%1$@

# transfer.item.already.destination
source: Item is already at the destination: %1$@
zh_hans: 项目已经位于目标位置：%1$@

# transfer.move
source: Move
zh_hans: 移动

# transfer.processed.items.restored.failed
source: %1$@ failed. Processed items restored: %2$@
zh_hans: %1$@失败，已恢复本次已处理项目：%2$@

# transfer.recursiveDestination
source: Cannot transfer a folder into itself: %1$@ → %2$@
zh_hans: 不能把文件夹传输到自身内部：%1$@ → %2$@

# transfer.rollbackFailed
source: %1$@ failed and processed items could not be fully restored. Original error: %2$@; recovery error: %3$@
zh_hans: %1$@失败，且无法完整恢复本次已处理项目。原始错误：%2$@；恢复错误：%3$@

# transfer.source.item.longer.exists.missing
source: Source item no longer exists: %1$@
zh_hans: 源项目已不存在：%1$@
